In [2]:
import numpy as np
import pandas as pd

In [3]:
data = ['50万以上', '10万以下', '10万以下', '50万以上',
        '10万以下', '10万以下', '30-50万', '10-30万']
df = pd.DataFrame({"data": data})
df

     data
0   50万以上
1   10万以下
2   10万以下
3   50万以上
4   10万以下
5   10万以下
6  30-50万
7  10-30万

In [4]:
df.data.astype("category").cat.codes

0    3
1    1
2    1
3    3
4    1
5    1
6    2
7    0
dtype: int8

In [5]:
df

     data
0   50万以上
1   10万以下
2   10万以下
3   50万以上
4   10万以下
5   10万以下
6  30-50万
7  10-30万

In [6]:
df.data = pd.factorize(df.data)[0]

In [7]:
df

   data
0     0
1     1
2     1
3     0
4     1
5     1
6     2
7     3

In [31]:
d = {"one":["张三","李四","张三"],"two":[1,np.nan,3],"tree":["开","关","未知"]}
dd = pd.DataFrame(d)
dd

  one  two tree
0  张三  1.0    开
1  李四  NaN    关
2  张三  3.0   未知

In [9]:
from sklearn.preprocessing import OneHotEncoder

In [26]:
X = dd["one"].to_numpy().reshape(-1,1)
X

array([['张三'],
       ['李四'],
       ['张三']], dtype=object)

In [28]:
enc = OneHotEncoder(categories="auto")
enc.fit_transform(X).toarray()

array([[1., 0.],
       [0., 1.],
       [1., 0.]])

In [30]:
enc.get_feature_names()

d:\install\python37\lib\site-packages\sklearn\utils\deprecation.py:87: FutureWarning: Function get_feature_names is deprecated; get_feature_names is deprecated in 1.0 and will be removed in 1.2. Please use get_feature_names_out instead.
  warnings.warn(msg, category=FutureWarning)

array(['x0_张三', 'x0_李四'], dtype=object)

In [33]:
XX= dd[["one","tree"]]
XX

  one tree
0  张三    开
1  李四    关
2  张三   未知

In [53]:
XX.columns

Index(['one', 'tree'], dtype='object')

In [37]:
enc2 = OneHotEncoder()
res = enc2.fit_transform(XX).toarray()
res

array([[1., 0., 0., 1., 0.],
       [0., 1., 1., 0., 0.],
       [1., 0., 0., 0., 1.]])

In [41]:
enc2.get_feature_names_out()

array(['one_张三', 'one_李四', 'tree_关', 'tree_开', 'tree_未知'], dtype=object)

In [43]:
enc2.inverse_transform(res)

array([['张三', '开'],
       ['李四', '关'],
       ['张三', '未知']], dtype=object)

In [54]:
pd.concat([dd,pd.DataFrame(res,columns=enc2.get_feature_names_out())],axis=1).drop(XX.columns,axis=1)

   two  one_张三  one_李四  tree_关  tree_开  tree_未知
0  1.0     1.0     0.0     0.0     1.0      0.0
1  NaN     0.0     1.0     1.0     0.0      0.0
2  3.0     1.0     0.0     0.0     0.0      1.0